MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024EFF064/mcu.h
extern volatile __DCH5DSAbits_t DCH5DSAbits __asm__ ("DCH5DSA") __attribute__((section("sfrs"), address(0xBF811460)));
extern volatile uint32_t        DCH5DSACLR __attribute__((section("sfrs"),address(0xBF811464)));
extern volatile uint32_t        DCH5DSASET __attribute__((section("sfrs"),address(0xBF811468)));
extern volatile uint32_t        DCH5DSAINV __attribute__((section("sfrs"),address(0xBF81146C)));
#define DCH5SSIZ DCH5SSIZ
extern volatile uint32_t   DCH5SSIZ __attribute__((section("sfrs"), address(0xBF811470)));
typedef struct {
  uint32_t CHSSIZ:16;
} __DCH5SSIZbits_t;
extern volatile __DCH5SSIZbits_t DCH5SSIZbits __asm__ ("DCH5SSIZ") __attribute__((section("sfrs"), address(0xBF811470)));
extern volatile uint32_t        DCH5SSIZCLR __attribute__((section("sfrs"),address(0xBF811474)));
extern volatile uint32_t        DCH5SSIZSET __attribute__((section("sfrs"),address(0xBF811478)));
extern volatile uint32_t        DCH5SSIZINV __attribute__((section("sfrs"),address(0xBF81147C)));
#define DCH5DSIZ DCH5DSIZ
extern volatile uint32_t   DCH5DSIZ __attribute__((section("sfrs"), address(0xBF811480)));
typedef struct {
  uint32_t CHDSIZ:16;
} __DCH5DSIZbits_t;
extern volatile __DCH5DSIZbits_t DCH5DSIZbits __asm__ ("DCH5DSIZ") __attribute__((section("sfrs"), address(0xBF811480)));
extern volatile uint32_t        DCH5DSIZCLR __attribute__((section("sfrs"),address(0xBF811484)));
extern volatile uint32_t        DCH5DSIZSET __attribute__((section("sfrs"),address(0xBF811488)));
extern volatile uint32_t        DCH5DSIZINV __attribute__((section("sfrs"),address(0xBF81148C)));
#define DCH5SPTR DCH5SPTR
extern volatile uint32_t   DCH5SPTR __attribute__((section("sfrs"), address(0xBF811490)));
typedef struct {
  uint32_t CHSPTR:16;
} __DCH5SPTRbits_t;
extern volatile __DCH5SPTRbits_t DCH5SPTRbits __asm__ ("DCH5SPTR") __attribute__((section("sfrs"), address(0xBF811490)));
extern volatile uint32_t        DCH5SPTRCLR __attribute__((section("sfrs"),address(0xBF811494)));
extern volatile uint32_t        DCH5SPTRSET __attribute__((section("sfrs"),address(0xBF811498)));
extern volatile uint32_t        DCH5SPTRINV __attribute__((section("sfrs"),address(0xBF81149C)));
#define DCH5DPTR DCH5DPTR
extern volatile uint32_t   DCH5DPTR __attribute__((section("sfrs"), address(0xBF8114A0)));
typedef struct {
  uint32_t CHDPTR:16;
} __DCH5DPTRbits_t;
extern volatile __DCH5DPTRbits_t DCH5DPTRbits __asm__ ("DCH5DPTR") __attribute__((section("sfrs"), address(0xBF8114A0)));
extern volatile uint32_t        DCH5DPTRCLR __attribute__((section("sfrs"),address(0xBF8114A4)));
extern volatile uint32_t        DCH5DPTRSET __attribute__((section("sfrs"),address(0xBF8114A8)));
extern volatile uint32_t        DCH5DPTRINV __attribute__((section("sfrs"),address(0xBF8114AC)));
#define DCH5CSIZ DCH5CSIZ
extern volatile uint32_t   DCH5CSIZ __attribute__((section("sfrs"), address(0xBF8114B0)));
typedef struct {
  uint32_t CHCSIZ:16;
} __DCH5CSIZbits_t;
extern volatile __DCH5CSIZbits_t DCH5CSIZbits __asm__ ("DCH5CSIZ") __attribute__((section("sfrs"), address(0xBF8114B0)));
extern volatile uint32_t        DCH5CSIZCLR __attribute__((section("sfrs"),address(0xBF8114B4)));
extern volatile uint32_t        DCH5CSIZSET __attribute__((section("sfrs"),address(0xBF8114B8)));
extern volatile uint32_t        DCH5CSIZINV __attribute__((section("sfrs"),address(0xBF8114BC)));
#define DCH5CPTR DCH5CPTR
extern volatile uint32_t   DCH5CPTR __attribute__((section("sfrs"), address(0xBF8114C0)));
typedef struct {
  uint32_t CHCPTR:16;
} __DCH5CPTRbits_t;
extern volatile __DCH5CPTRbits_t DCH5CPTRbits __asm__ ("DCH5CPTR") __attribute__((section("sfrs"), address(0xBF8114C0)));
#define DCS5CPTR DCS5CPTR
extern volatile uint32_t   DCS5CPTR __attribute__((section("sfrs"), address(0xBF8114C0)));
typedef struct {
  uint32_t CHCPTR:16;
} __DCS5CPTRbits_t;
extern volatile __DCS5CPTRbits_t DCS5CPTRbits __asm__ ("DCS5CPTR") __attribute__((section("sfrs"), address(0xBF8114C0)));
extern volatile uint32_t        DCH5CPTRCLR __attribute__((section("sfrs"),address(0xBF8114C4)));
extern volatile uint32_t        DCS5CPTRCLR __attribute__((section("sfrs"),address(0xBF8114C4)));
extern volatile uint32_t        DCH5CPTRSET __attribute__((section("sfrs"),address(0xBF8114C8)));
extern volatile uint32_t        DCS5CPTRSET __attribute__((section("sfrs"),address(0xBF8114C8)));
extern volatile uint32_t        DCH5CPTRINV __attribute__((section("sfrs"),address(0xBF8114CC)));
extern volatile uint32_t        DCS5CPTRINV __attribute__((section("sfrs"),address(0xBF8114CC)));
#define DCH5DAT DCH5DAT
extern volatile uint32_t   DCH5DAT __attribute__((section("sfrs"), address(0xBF8114D0)));
typedef struct {
  uint32_t CHPDAT:16;
} __DCH5DATbits_t;
extern volatile __DCH5DATbits_t DCH5DATbits __asm__ ("DCH5DAT") __attribute__((section("sfrs"), address(0xBF8114D0)));
extern volatile uint32_t        DCH5DATCLR __attribute__((section("sfrs"),address(0xBF8114D4)));
extern volatile uint32_t        DCH5DATSET __attribute__((section("sfrs"),address(0xBF8114D8)));
extern volatile uint32_t        DCH5DATINV __attribute__((section("sfrs"),address(0xBF8114DC)));
#define DCH6CON DCH6CON
extern volatile uint32_t   DCH6CON __attribute__((section("sfrs"), address(0xBF8114E0)));
typedef struct {
  uint32_t CHPRI:2;
  uint32_t CHEDET:1;
  uint32_t :1;
  uint32_t CHAEN:1;
  uint32_t CHCHN:1;
  uint32_t CHAED:1;
  uint32_t CHEN:1;
  uint32_t CHCHNS:1;
  uint32_t :2;
  uint32_t CHPATLEN:1;
  uint32_t :1;
  uint32_t CHPIGNEN:1;
  uint32_t :1;
  uint32_t CHBUSY:1;
  uint32_t :8;
  uint32_t CHPIGN:8;
} __DCH6CONbits_t;
extern volatile __DCH6CONbits_t DCH6CONbits __asm__ ("DCH6CON") __attribute__((section("sfrs"), address(0xBF8114E0)));
extern volatile uint32_t        DCH6CONCLR __attribute__((section("sfrs"),address(0xBF8114E4)));
extern volatile uint32_t        DCH6CONSET __attribute__((section("sfrs"),address(0xBF8114E8)));
extern volatile uint32_t        DCH6CONINV __attribute__((section("sfrs"),address(0xBF8114EC)));
#define DCH6ECON DCH6ECON
extern volatile uint32_t   DCH6ECON __attribute__((section("sfrs"), address(0xBF8114F0)));
typedef struct {
  uint32_t :3;
  uint32_t AIRQEN:1;
  uint32_t SIRQEN:1;
  uint32_t PATEN:1;
  uint32_t CABORT:1;
  uint32_t CFORCE:1;
  uint32_t CHSIRQ:8;
  uint32_t CHAIRQ:8;
} __DCH6ECONbits_t;
