MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024EFF064/mcu.h
#define _U1STA_URXISEL_POSITION                  0x00000006
#define _U1STA_URXISEL_MASK                      0x000000C0
#define _U1STA_URXISEL_LENGTH                    0x00000002

#define _U1STA_TRMT_POSITION                     0x00000008
#define _U1STA_TRMT_MASK                         0x00000100
#define _U1STA_TRMT_LENGTH                       0x00000001

#define _U1STA_UTXBF_POSITION                    0x00000009
#define _U1STA_UTXBF_MASK                        0x00000200
#define _U1STA_UTXBF_LENGTH                      0x00000001

#define _U1STA_UTXEN_POSITION                    0x0000000A
#define _U1STA_UTXEN_MASK                        0x00000400
#define _U1STA_UTXEN_LENGTH                      0x00000001

#define _U1STA_UTXBRK_POSITION                   0x0000000B
#define _U1STA_UTXBRK_MASK                       0x00000800
#define _U1STA_UTXBRK_LENGTH                     0x00000001

#define _U1STA_URXEN_POSITION                    0x0000000C
#define _U1STA_URXEN_MASK                        0x00001000
#define _U1STA_URXEN_LENGTH                      0x00000001

#define _U1STA_UTXINV_POSITION                   0x0000000D
#define _U1STA_UTXINV_MASK                       0x00002000
#define _U1STA_UTXINV_LENGTH                     0x00000001

#define _U1STA_UTXISEL_POSITION                  0x0000000E
#define _U1STA_UTXISEL_MASK                      0x0000C000
#define _U1STA_UTXISEL_LENGTH                    0x00000002

#define _U1STA_ADDR_POSITION                     0x00000010
#define _U1STA_ADDR_MASK                         0x00FF0000
#define _U1STA_ADDR_LENGTH                       0x00000008

#define _U1STA_ADM_EN_POSITION                   0x00000018
#define _U1STA_ADM_EN_MASK                       0x01000000
#define _U1STA_ADM_EN_LENGTH                     0x00000001

#define _U1STA_URXISEL0_POSITION                 0x00000006
#define _U1STA_URXISEL0_MASK                     0x00000040
#define _U1STA_URXISEL0_LENGTH                   0x00000001

#define _U1STA_URXISEL1_POSITION                 0x00000007
#define _U1STA_URXISEL1_MASK                     0x00000080
#define _U1STA_URXISEL1_LENGTH                   0x00000001

#define _U1STA_UTXISEL0_POSITION                 0x0000000E
#define _U1STA_UTXISEL0_MASK                     0x00004000
#define _U1STA_UTXISEL0_LENGTH                   0x00000001

#define _U1STA_UTXISEL1_POSITION                 0x0000000F
#define _U1STA_UTXISEL1_MASK                     0x00008000
#define _U1STA_UTXISEL1_LENGTH                   0x00000001

#define _U1STA_UTXSEL_POSITION                   0x0000000E
#define _U1STA_UTXSEL_MASK                       0x0000C000
#define _U1STA_UTXSEL_LENGTH                     0x00000002

#define _U1STA_w_POSITION                        0x00000000
#define _U1STA_w_MASK                            0xFFFFFFFF
#define _U1STA_w_LENGTH                          0x00000020

#define _UABSTA_URXDA_POSITION                   0x00000000
#define _UABSTA_URXDA_MASK                       0x00000001
#define _UABSTA_URXDA_LENGTH                     0x00000001

#define _UABSTA_OERR_POSITION                    0x00000001
#define _UABSTA_OERR_MASK                        0x00000002
#define _UABSTA_OERR_LENGTH                      0x00000001

#define _UABSTA_FERR_POSITION                    0x00000002
#define _UABSTA_FERR_MASK                        0x00000004
#define _UABSTA_FERR_LENGTH                      0x00000001

#define _UABSTA_PERR_POSITION                    0x00000003
#define _UABSTA_PERR_MASK                        0x00000008
#define _UABSTA_PERR_LENGTH                      0x00000001

#define _UABSTA_RIDLE_POSITION                   0x00000004
#define _UABSTA_RIDLE_MASK                       0x00000010
#define _UABSTA_RIDLE_LENGTH                     0x00000001

#define _UABSTA_ADDEN_POSITION                   0x00000005
#define _UABSTA_ADDEN_MASK                       0x00000020
#define _UABSTA_ADDEN_LENGTH                     0x00000001

#define _UABSTA_URXISEL_POSITION                 0x00000006
#define _UABSTA_URXISEL_MASK                     0x000000C0
#define _UABSTA_URXISEL_LENGTH                   0x00000002

#define _UABSTA_TRMT_POSITION                    0x00000008
#define _UABSTA_TRMT_MASK                        0x00000100
#define _UABSTA_TRMT_LENGTH                      0x00000001

#define _UABSTA_UTXBF_POSITION                   0x00000009
#define _UABSTA_UTXBF_MASK                       0x00000200
#define _UABSTA_UTXBF_LENGTH                     0x00000001

#define _UABSTA_UTXEN_POSITION                   0x0000000A
#define _UABSTA_UTXEN_MASK                       0x00000400
#define _UABSTA_UTXEN_LENGTH                     0x00000001

#define _UABSTA_UTXBRK_POSITION                  0x0000000B
#define _UABSTA_UTXBRK_MASK                      0x00000800
#define _UABSTA_UTXBRK_LENGTH                    0x00000001

#define _UABSTA_URXEN_POSITION                   0x0000000C
#define _UABSTA_URXEN_MASK                       0x00001000
#define _UABSTA_URXEN_LENGTH                     0x00000001

#define _UABSTA_UTXINV_POSITION                  0x0000000D
#define _UABSTA_UTXINV_MASK                      0x00002000
#define _UABSTA_UTXINV_LENGTH                    0x00000001

#define _UABSTA_UTXISEL_POSITION                 0x0000000E
#define _UABSTA_UTXISEL_MASK                     0x0000C000
#define _UABSTA_UTXISEL_LENGTH                   0x00000002

#define _UABSTA_ADDR_POSITION                    0x00000010
#define _UABSTA_ADDR_MASK                        0x00FF0000
#define _UABSTA_ADDR_LENGTH                      0x00000008

#define _UABSTA_ADM_EN_POSITION                  0x00000018
#define _UABSTA_ADM_EN_MASK                      0x01000000
#define _UABSTA_ADM_EN_LENGTH                    0x00000001

#define _UABSTA_URXISEL0_POSITION                0x00000006
#define _UABSTA_URXISEL0_MASK                    0x00000040
#define _UABSTA_URXISEL0_LENGTH                  0x00000001

#define _UABSTA_URXISEL1_POSITION                0x00000007
#define _UABSTA_URXISEL1_MASK                    0x00000080
#define _UABSTA_URXISEL1_LENGTH                  0x00000001

#define _UABSTA_UTXISEL0_POSITION                0x0000000E
#define _UABSTA_UTXISEL0_MASK                    0x00004000
#define _UABSTA_UTXISEL0_LENGTH                  0x00000001

#define _UABSTA_UTXISEL1_POSITION                0x0000000F
#define _UABSTA_UTXISEL1_MASK                    0x00008000
#define _UABSTA_UTXISEL1_LENGTH                  0x00000001

#define _UABSTA_UTXSEL_POSITION                  0x0000000E
#define _UABSTA_UTXSEL_MASK                      0x0000C000
#define _UABSTA_UTXSEL_LENGTH                    0x00000002

